load-tests/artillery-config.yml
/**
 * Artillery Load Testing Configuration
 * 
 * Alternative to k6 with different features:
 * - Built-in reporting
 * - Plugin ecosystem
 * - Easier configuration
 * 
 * Usage:
 *   npm run load-test:artillery
 *   artillery run load-tests/artillery-config.yml
 *   artillery run --target http://localhost:3000 load-tests/artillery-config.yml
 */

config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3000' }}"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up to normal load"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained normal load"
    
    # Peak load phase
    - duration: 180
      arrivalRate: 100
      name: "Peak load"
    
    # Cool down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"
  
  # HTTP configuration
  http:
    timeout: 10
    maxSockets: 100
  
  # Plugins
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  
  # Performance expectations
  ensure:
    maxErrorRate: 1        # Max 1% error rate
    p95: 500               # 95th percentile < 500ms
    p99: 1000              # 99th percentile < 1000ms
  
  # Variables
  variables:
    testEmail:
      - "load-test-1@example.com"
      - "load-test-2@example.com"
      - "load-test-3@example.com"
    testPassword: "LoadTest123!@#"
  
  # Processor for custom logic
  processor: "./load-tests/artillery-processor.js"

# Test scenarios
scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status

  # Authentication scenario
  - name: "User Authentication"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 
                - 200
                - 401  # User might not exist
      
      # Get user profile (if authenticated)
      - get:
          url: "/api/user/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
          expect:
            - statusCode:
                - 200
                - 401

  # Resource CRUD operations
  - name: "Resource Operations"
    weight: 40
    flow:
      # Login first
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # List resources
      - get:
          url: "/api/resources"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
          expect:
            - statusCode:
                - 200
                - 401
                - 404
      
      # Create resource
      - post:
          url: "/api/resources"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Load Test Resource {{ $randomString() }}"
            description: "Created during Artillery load test"
          ifTrue: "authToken"
          capture:
            - json: "$.id"
              as: "resourceId"
          expect:
            - statusCode:
                - 200
                - 201
                - 401
                - 404
      
      # Get specific resource
      - get:
          url: "/api/resources/{{ resourceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "resourceId"
          expect:
            - statusCode:
                - 200
                - 404
      
      # Update resource
      - put:
          url: "/api/resources/{{ resourceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Updated Load Test Resource"
          ifTrue: "resourceId"
          expect:
            - statusCode:
                - 200
                - 404
      
      # Delete resource
      - delete:
          url: "/api/resources/{{ resourceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "resourceId"
          expect:
            - statusCode:
                - 200
                - 204
                - 404

  # Search and filter scenario
  - name: "Search Operations"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/resources/search?q=test&page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
          expect:
            - statusCode:
                - 200
                - 404

# After test hooks
after:
  flow:
    - log: "Load test completed. Check artillery report for details."